[
  {
    "id": "alphabet_1",
    "subject_en": "German Alphabet – Overview",
    "subject_fa": "حروف الفبای آلمانی – کلیات",
    "subject_de": "Das Alphabet",
    "description_en": "The German alphabet has 26 basic letters like English (A–Z) plus 4 extra characters: Ä, Ö, Ü (called “Umlaut” vowels) and ß (called “Eszett” or “scharfes S”).",
    "description_fa": "الفبای آلمانی هم مثل انگلیسی ۲۶ حرف اصلی از A تا Z دارد. علاوه بر این ۴ نشانهٔ مهم دیگر هم داریم: Ä، Ö، Ü و ß. سه‌تای اول را «مصوت‌های اُوملات» (Umlaute) می‌گوییم و صدای مصوت را کمی عوض می‌کنند. علامت ß را «اس‌تست» یا «s تیز» می‌نامند و شبیه یک s کشیده تلفظ می‌شود.",
    "examples_en": [
      "ä like in “Mädchen”",
      "ö like in “schön”",
      "ü like in “Tschüss”",
      "ß like in “Straße”"
    ],
    "examples_fa": [
      "ä مثل صدای «اِ/اَ» در کلمهٔ آلمانی „Mädchen“ (معنی: دختر)",
      "ö شبیه ترکیب «اوِ» است، مثل „schön“ (معنی: زیبا)",
      "ü شبیه «او» تلفظ می‌شود ولی با لب‌های جمع و کشیده، مثل „Tschüss“ (معنی: خداحافظ)",
      "ß صدای s تیز می‌دهد، مثل „Straße“ (معنی: خیابان)"
    ],
    "audio_de": "",
    "images": [],
    "category": "alphabet"
  },
  {
    "id": "alphabet_2",
    "subject_en": "Vowels (A, E, I, O, U)",
    "subject_fa": "حروف صدادار (مصوت‌ها: A، E، I، O، U)",
    "subject_de": "Vokale",
    "description_en": "German vowels can be short or long. A doubled consonant after a vowel usually makes it short.",
    "description_fa": "در آلمانی حروف صدادار (A، E، I، O، U) می‌توانند کوتاه یا بلند تلفظ شوند. اغلب وقتی بعد از یک مصوت، دو تا حرف بی‌صدا (مثل tt، nn، ss) می‌آید، آن مصوت کوتاه تلفظ می‌شود. اگر بعد از مصوت فقط یک بی‌صدا باشد یا یک h بی‌صدا (مثل ah, eh)، معمولاً آن مصوت کشیده و بلند تلفظ می‌شود.",
    "examples_en": [
      "Short: “Mann”, “Sonne”, “Mitte”",
      "Long: “Name”, “Meer”, “Liebe”, “Boot”, “gut”",
      "“Mitte” (short i) vs “Miete” (long ie)"
    ],
    "examples_fa": [
      "کوتاه: „Mann“ (مرد)، „Sonne“ (خورشید)، „Mitte“ (وسط) – مصوت قبل از دو حرف بی‌صدا کوتاه است.",
      "بلند: „Name“ (اسم)، „Meer“ (دریا)، „Liebe“ (عشق)، „Boot“ (قایق)، „gut“ (خوب) – مصوت کشیده‌تر تلفظ می‌شود.",
      "تفاوت: „Mitte“ با i کوتاه (میتّه) در مقابل „Miete“ با ie بلند (میته – معنی: اجاره)."
    ],
    "audio_de": "",
    "images": [],
    "category": "alphabet"
  },
  {
    "id": "alphabet_3",
    "subject_en": "Umlaut vowels (Ä, Ö, Ü)",
    "subject_fa": "مصوت‌های اُوملات (Ä، Ö، Ü)",
    "subject_de": "Umlaute",
    "description_en": "Umlaut vowels change the sound and sometimes the meaning. They can be typed as ä → ae, ö → oe, ü → ue.",
    "description_fa": "مصوت‌های اُوملات (Ä، Ö، Ü) هم تلفظ را تغییر می‌دهند و هم گاهی معنی کلمه را عوض می‌کنند (مثلاً مفرد و جمع را از هم جدا می‌کنند). اگر نتوانی روی کیبورد این حروف را بنویسی، می‌توانی به شکل ae، oe و ue بنویسی و هنوز هم برای آلمانی‌ها قابل فهم است.",
    "examples_en": [
      "a → ä : “Mann” vs “Männer”",
      "o → ö : “schon” vs “schön”",
      "u → ü : “Mutter” vs “Mütter”"
    ],
    "examples_fa": [
      "a → ä: „Mann“ (یک مرد) در مقابل „Männer“ (مردها – جمع). اینجا ä هم تلفظ و هم معنی را عوض کرده.",
      "o → ö: „schon“ (قبلاً / همین حالا) در مقابل „schön“ (زیبا). تغییر اُوملات معنی را کاملاً عوض می‌کند.",
      "u → ü: „Mutter“ (مادر) در مقابل „Mütter“ (مادرها – جمع)."
    ],
    "audio_de": "",
    "images": [],
    "category": "alphabet"
  },
  {
    "id": "alphabet_4",
    "subject_en": "ß – Eszett",
    "subject_fa": "ß – اس‌تست (s تیز)",
    "subject_de": "Eszett",
    "description_en": "ß is used only in German and sounds like a sharp “s”. If you can’t type ß, you can use “ss”.",
    "description_fa": "حرف ß فقط در زبان آلمانی استفاده می‌شود و مثل یک s تیز و کشیده تلفظ می‌شود. اگر روی کیبوردت ß نداری، می‌توانی به‌جای آن „ss“ بنویسی. در بسیاری از کلمات مدرن آلمانی، شکل ss هم پذیرفته شده است.",
    "examples_en": [
      "Straße → Strasse",
      "Fuß → Fuss",
      "heißen and Straße (ß pronounced like sharp s)"
    ],
    "examples_fa": [
      "„Straße“ (خیابان) را اگر نتوانی ß بنویسی، می‌توانی „Strasse“ تایپ کنی.",
      "„Fuß“ (پا) را می‌توان „Fuss“ هم نوشت، تلفظ همان s تیز است.",
      "در کلماتی مثل „heißen“ (نام داشتن) و „Straße“، ß همیشه مثل s تیز تلفظ می‌شود، نه مثل z یا ش."
    ],
    "audio_de": "",
    "images": [],
    "category": "alphabet"
  }
]
